masumbillah74/controlpoint/nrf52_setup/nRF5_SDK_14.0.0_3bcc1f7/examples/ble_central_and_peripheral/experimental/central/old_main.c
void test_terminate(void);
static void scan_start(void);
static void advertising_start(void);
static void advertising_stop(void);
void ifs_tof_evt_handler(ifs_tof_evt_t * p_evt);
static void scan_stop(void);
static bool is_link_present(ble_gap_evt_adv_report_t const * p_adv_report);
static node_t* add_node_to_network(const ble_gap_evt_t *p_evt);
node_t* get_first_free_network_pos(void);
node_t* get_network_pos_by_conn_handle(uint16_t target_conn_h);
void test_begin(void);
static void test_run(void);
static bool is_test_ready();

static void reset_network(void){
	memset(m_network, 0x00, MAXIMUM_NETWORK_SIZE*sizeof(node_t));
	for(uint8_t n = 0; n < MAXIMUM_NETWORK_SIZE; n++){
		m_network[n].conn_handle = BLE_CONN_HANDLE_INVALID;
	}
}

static node_t* add_node_to_network(const ble_gap_evt_t *p_evt){
	node_t* p_node = get_first_free_network_pos();
	if(p_node == NULL){
		return NULL;
	}

	p_node->conn_handle = p_evt->conn_handle;
	memcpy(&p_node->bd_address, &p_evt->params.connected.peer_addr, sizeof(ble_gap_addr_t));
	p_node->local_role = p_evt->params.connected.role;
	return p_node;
}

static void remove_node_from_network(const ble_gap_evt_t *p_evt){
	node_t* p_node = get_network_pos_by_conn_handle(p_evt->conn_handle);
	if(p_node == NULL){
		return;
	}

	p_node->conn_handle = BLE_CONN_HANDLE_INVALID;
	memset(&p_node->bd_address, 0x00, sizeof(ble_gap_addr_t));
	p_node->local_role = BLE_GAP_ROLE_INVALID;
	return;
}

node_t* get_first_free_network_pos(void){
	return get_network_pos_by_conn_handle(BLE_CONN_HANDLE_INVALID); //a free position is marked with conn_handle == BLE_CONN_HANDLE_INVALID
}

node_t* get_network_pos_by_conn_handle(uint16_t target_conn_h){
	for(uint8_t n = 0; n < MAXIMUM_NETWORK_SIZE; n++){
		if(m_network[n].conn_handle == target_conn_h){
			return &m_network[n];
		}
	}
	return NULL;
}

static uint32_t calculate_ifs_offset(ble_gap_phys_t actual_phy) {
//#ifdef S140
	uint8_t data_rate_mbps;
	switch (actual_phy.rx_phys) {
	case BLE_GAP_PHY_1MBPS:
		data_rate_mbps = 1;
		return (uint32_t) (T_IFS_us + PREAMBLE_LEGNTH_us + ACCESS_ADDRESS_LENGTH_bit / data_rate_mbps + RX_CHAIN_DELAY_1MPHY_us)
				* IFS_TIMER_TICK_FREQUENCY_MHZ;

	case BLE_GAP_PHY_2MBPS:
		data_rate_mbps = 2;
		return (uint32_t) (T_IFS_us + PREAMBLE_LEGNTH_us + ACCESS_ADDRESS_LENGTH_bit / data_rate_mbps + RX_CHAIN_DELAY_2MPHY_us)
				* IFS_TIMER_TICK_FREQUENCY_MHZ;

	case BLE_GAP_PHY_CODED:
		return 0;
		break;
	default:
		data_rate_mbps = 1;
		return (uint32_t) (T_IFS_us + PREAMBLE_LEGNTH_us + ACCESS_ADDRESS_LENGTH_bit / data_rate_mbps + RX_CHAIN_DELAY_1MPHY_us)
				* IFS_TIMER_TICK_FREQUENCY_MHZ;
		break;
	}

}


char const * phy_str(ble_gap_phys_t phys)
{
    static char const * str[] =
    {
        "1 Mbps",
        "2 Mbps",
        "Coded",
        "Unknown"
    };

    switch (phys.tx_phys)
    {
        case BLE_GAP_PHY_1MBPS:
            return str[0];

        case BLE_GAP_PHY_2MBPS:
        case BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS:
        case BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_CODED:
            return str[1];

        case BLE_GAP_PHY_CODED:
            return str[2];

        default:
            return str[3];
	}
}

uint32_t bd_addr_to_string(const ble_gap_addr_t *p_addr, char* p_str) {
	return sprintf(p_str, "%02X:%02X:%02X:%02X:%02X:%02X", p_addr->addr[5], p_addr->addr[4], p_addr->addr[3], p_addr->addr[2], p_addr->addr[1],
			p_addr->addr[0]);
}

void tof_results_print(ifs_tof_t * p_ctx) 
{
//	if (m_board_role == BOARD_TESTER)
	{
		char c;
		if (m_test_params.continuous_test) {
			c = 's'; //when the test is continuous just print the summary
		}else{
			c = 'p';
		}

		if (c == 'p' || c == 's') 
		{

			float ifs_duration_ticks_avg = 0;
			float rssi_avg = 0;

			static char addr_str[30]; //18 should be enough, but it mess up
			static uint8_t count = 0;
			bd_addr_to_string(&p_ctx->bd_address, addr_str);

			//if(strcmp(addr_str, devices[currentDevice]) != 0) return;
			//currentDevice = currentDevice + 1;
			//if(currentDevice==totalDevices) currentDevice = 0;

			for (uint32_t i = 0; i < TOF_SAMPLES_TO_ACQUIRE; i++) 
			{
				if (c == 'p') {
#ifdef USE_NANOSECOND
					NRF_LOG_INFO("i = %u ifs_duration_ticks = %u ticks rssi = %d dBm radio_freq = 0x%08x\n\r", i,
							p_ctx->buffer[i].ifs_duration_ticks, p_ctx->buffer[i].rssi,
							p_ctx->buffer[i].frequency_reg);
#else
					NRF_LOG_INFO("i = %u ifs_duration_ticks = %u ns rssi = %d dBm radio_freq = 0x%08x\n\r", i,
							p_ctx->buffer[i].ifs_duration_ticks, p_ctx->buffer[i].rssi,
							p_ctx->buffer[i].frequency_reg);
#endif
				}

				ifs_duration_ticks_avg += p_ctx->buffer[i].ifs_duration_ticks;
				rssi_avg += p_ctx->buffer[i].rssi;

				if (i % 25 == 0 && c == 'p') {
					NRF_LOG_FLUSH()
					;
				}
			}
			ifs_duration_ticks_avg = ifs_duration_ticks_avg / TOF_SAMPLES_TO_ACQUIRE;
			rssi_avg = rssi_avg / TOF_SAMPLES_TO_ACQUIRE;

			char line[300];
#ifdef USE_NANOSECOND
			float ifs_duration_ns_comp_avg = (ifs_duration_ticks_avg - ifs_offset_ticks)/(((float)IFS_TIMER_TICK_FREQUENCY_MHZ) / 1000);


			if(TOF_SAMPLES_TO_ACQUIRE == 1)
			{

				//int i = currentDevice-1;

				int i;
				for(i = 0; i<totalDevices; i++)
				{

					if(strcmp(addr_str, devices[i]) == 0) break;

				}

				current_time[i] = app_timer_cnt_get();
				duration_time[i] = app_timer_cnt_diff_compute(current_time[i], previous_time[i]);	

				//sprintf(line, ", %s, "NRF_LOG_FLOAT_MARKER", %d, %u\n\r",addr_str,NRF_LOG_FLOAT(ifs_duration_ns_comp_avg), p_ctx->buffer[0].rssi, duration_time[i]);
				sprintf(line, ": %d, "NRF_LOG_FLOAT_MARKER", %d, %u:", i, NRF_LOG_FLOAT(ifs_duration_ns_comp_avg), p_ctx->buffer[0].rssi, duration_time[i]);

				
				NRF_LOG_INFO("%s",nrf_log_push(line));

				previous_time[i] = app_timer_cnt_get();

				uint8_t adv_data[] = "aaaaaaaaaaaaaaaaaaaaaaa";	

				for(int i=0;i<sizeof(line);i++)
				{
					adv_data[i] = (uint8_t)(line[i]);
				}				

