masumbillah74/controlpoint/nrf52_setup/nRF5_SDK_14.0.0_3bcc1f7/examples/ble_central_and_peripheral/experimental/central/old_main.c
            NRF_LOG_INFO("PHY update %s. PHY set to %s.\n\r",
                         (p_phy_evt->status == BLE_HCI_STATUS_CODE_SUCCESS) ?
                         "accepted" : "rejected",
                         phy_str(phys));


        } break;
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            err_code = sd_ble_gap_phy_update(p_gap_evt->conn_handle, &m_test_params.phys);
            APP_ERROR_CHECK(err_code);
        } break;
#endif

        default:
            // No implementation needed.
            break;
    }
}

void on_ifs_tof_buffer_full(ifs_tof_t * p_ctx) {
	bsp_board_led_invert(DONE_LED);
//	tof_samples = TOF_SAMPLES_TO_ACQUIRE;
	if (!m_test_params.continuous_test) {
		test_terminate();
	}
	tof_results_print(p_ctx);
}

/**@brief Evt dispatcher for ifs_tof module*/
void ifs_tof_evt_handler(ifs_tof_evt_t * p_evt) {

		switch (p_evt->evt_type) {
		case IFS_TOF_EVT_BUFFER_FULL: {
			on_ifs_tof_buffer_full(p_evt->p_ctx);
		}
			break;
		default: {
	//no implementation needed
		}
			break;
		}
}

static void db_disc_evt_handler(ble_db_discovery_evt_t * p_evt)
{
	//no module uses gatt, then there is no need of discovering database
}


/**@brief Function for handling events from the GATT library. */
static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
#ifdef ENABLE_GATT
    switch (p_evt->evt_id)
    {
        case NRF_BLE_GATT_EVT_ATT_MTU_UPDATED:
        {
            m_mtu_exchanged = true;
            //NRF_LOG_INFO("ATT MTU exchange completed. MTU set to %u bytes.\n\r",
                  //       p_evt->params.att_mtu_effective);
        } break;

        case NRF_BLE_GATT_EVT_DATA_LENGTH_UPDATED:
        {
            m_data_length_updated = true;
            //NRF_LOG_INFO("Data length updated to %u bytes.\n\r", p_evt->params.data_length);
        } break;
    }
#endif
}


/**@brief Function for setting up advertising data. */
/*
static void advertising_data_set(void)
{
#ifndef DISABLE_ADV
    ble_advdata_t const adv_data =
    {
        .name_type          = BLE_ADVDATA_FULL_NAME,
        .flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE,
        .include_appearance = false,
    };

    ret_code_t err_code = ble_advdata_set(&adv_data, NULL);
    APP_ERROR_CHECK(err_code);
#endif
}*/

static void advertising_init(void)
{
    uint32_t      err_code;
    uint8_t       flags = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
    //uint8_t       flags =   BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    manuf_specific_data.company_identifier = APP_COMPANY_IDENTIFIER;
    uint8_t data[]                            = "Some random data";
    manuf_specific_data.data.p_data = data;
    manuf_specific_data.data.size   = sizeof(data);

    // Build and set advertising data.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type             = BLE_ADVDATA_NO_NAME;
    advdata.flags                 = flags;
    advdata.p_manuf_specific_data = &manuf_specific_data;

    err_code = ble_advdata_set(&advdata, NULL);
    APP_ERROR_CHECK(err_code);

    // Initialize advertising parameters (used when starting advertising).
    memset(&m_adv_params, 0, sizeof(m_adv_params));

    m_adv_params.type        = BLE_GAP_ADV_TYPE_ADV_NONCONN_IND;
    m_adv_params.p_peer_addr = NULL;    // Undirected advertisement.
    m_adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    m_adv_params.interval    = NON_CONNECTABLE_ADV_INTERVAL;
    m_adv_params.timeout     = 0;       // 0 for Never time out.
}

static void advertising_start(void)
{
	if (!m_advertising_active) 
	{
		m_advertising_active = true;

    ret_code_t err_code;

    err_code = sd_ble_gap_adv_start(&m_adv_params, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    APP_ERROR_CHECK(err_code);
	}
}

/**@brief Function for starting advertising. */
/*static void advertising_start(void)
 {
#ifndef DISABLE_ADV
	if (!m_advertising_active) {
		ble_gap_adv_params_t const adv_params = { .type = BLE_GAP_ADV_TYPE_ADV_IND, .p_peer_addr = NULL, .fp = BLE_GAP_ADV_FP_ANY, .interval =
		ADV_INTERVAL, .timeout = 0, };

		NRF_LOG_INFO("Starting advertising.\n\r");

		bsp_board_led_on(SCAN_ADV_LED);
		m_advertising_active = true;
		ret_code_t err_code = sd_ble_gap_adv_start(&adv_params, APP_BLE_CONN_CFG_TAG);
		APP_ERROR_CHECK(err_code);
	}
#endif
}*/

/**@brief Function for starting advertising. */
static void advertising_stop(void) {
#ifndef DISABLE_ADV
	if (m_advertising_active) {
		//NRF_LOG_INFO("Stopping advertising.\n\r");

		bsp_board_led_off(SCAN_ADV_LED);
		m_advertising_active = false;
		ret_code_t err_code = sd_ble_gap_adv_stop();
		APP_ERROR_CHECK(err_code);
	}
#endif
}

/**@brief Function to start scanning. */
static void scan_start(void)
{
    if(!m_scan_active){
        //NRF_LOG_INFO("Starting scan.\n\r");

        bsp_board_led_on(SCAN_ADV_LED);
		m_scan_active = true;
		ret_code_t err_code = sd_ble_gap_scan_start(&m_scan_param);
		APP_ERROR_CHECK(err_code);
    }
}


static void scan_stop(void){
	if (m_scan_active) {
		//NRF_LOG_INFO("Stopping scan.\n\r");

		bsp_board_led_off(SCAN_ADV_LED);
		m_scan_active = false;
		ret_code_t err_code = sd_ble_gap_scan_stop();
		APP_ERROR_CHECK(err_code);
	}
}

static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(app_timer_cnt_get);
    APP_ERROR_CHECK(err_code);
}



static void leds_init(void)
{
    bsp_board_leds_init();
}



static void timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}



static void buttons_enable(void)
{
    ret_code_t err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for disabling button input. */
static void buttons_disable(void)
{
    ret_code_t err_code = app_button_disable();
    APP_ERROR_CHECK(err_code);
}


static void button_evt_handler(uint8_t pin_no, uint8_t button_action)
{
    switch (pin_no)
    {
        case BOARD_TESTER_BUTTON:
        {
            //NRF_LOG_INFO("Single test started.\n\r");
            m_test_params.continuous_test = false;
            m_board_role = BOARD_TESTER;
            instructions_print();
            //advertising_start();
            scan_start();
        } break;

        case BOARD_DUMMY_BUTTON:
        {
            //NRF_LOG_INFO("Continuous test started.\n\r");
            m_test_params.continuous_test = true;
            m_board_role = BOARD_DUMMY;
            test_begin();
            //advertising_start();
            scan_start();
        } break;

        default:
            break;
    }
    buttons_disable();
}


static void buttons_init(void)
{
   // The array must be static because a pointer to it will be saved in the button library.
    static app_button_cfg_t buttons[] =
    {
        {BOARD_TESTER_BUTTON, false, BUTTON_PULL, button_evt_handler},
        {BOARD_DUMMY_BUTTON,  false, BUTTON_PULL, button_evt_handler}
    };

    ret_code_t err_code = app_button_init(buttons, ARRAY_SIZE(buttons), BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


