masumbillah74/controlpoint/nrf52_setup/nRF5_SDK_14.0.0_3bcc1f7/examples/ble_central_and_peripheral/experimental/central/old_main.c
static void client_init(void)
{
#ifdef ENABLE_GATT
    ret_code_t err_code = ble_db_discovery_init(db_disc_evt_handler);
    APP_ERROR_CHECK(err_code);
#endif
}


static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (uint8_t const *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_ppcp_set(&m_conn_param);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT library. */
static void gatt_init(void)
{
#ifdef ENABLE_GATT
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);
#endif
}

static void wait_for_event(void)
{
    (void) sd_app_evt_wait();
}


void preferred_phy_set(ble_gap_phys_t * p_phy)
{
#if defined(S140)
    ble_opt_t opts;
    memset(&opts, 0x00, sizeof(ble_opt_t));
    memcpy(&opts.gap_opt.preferred_phys, p_phy, sizeof(ble_gap_phys_t));
    ret_code_t err_code = sd_ble_opt_set(BLE_GAP_OPT_PREFERRED_PHYS_SET, &opts);
    APP_ERROR_CHECK(err_code);
#endif
    memcpy(&m_test_params.phys, p_phy, sizeof(ble_gap_phys_t));
}


void gatt_mtu_set(uint16_t att_mtu)
{
#ifdef ENABLE_GATT
    ret_code_t err_code;

    m_test_params.att_mtu = att_mtu;

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, att_mtu);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, att_mtu);
    APP_ERROR_CHECK(err_code);
#endif
}

void conn_interval_set(uint16_t value)
{
    m_test_params.conn_interval = value;
}


static void conn_evt_len_ext_set(bool status)
{
    ret_code_t err_code;
    ble_opt_t  opt;

    memset(&opt, 0x00, sizeof(opt));
    opt.common_opt.conn_evt_ext.enable = status ? 1 : 0;

    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);
}


void data_len_ext_set(bool status)
{
#ifdef ENABLE_GATT
    m_test_params.data_len_ext_enabled = status;

    uint8_t data_length = status ? (247 + L2CAP_HDR_LEN) : (23 + L2CAP_HDR_LEN);
    (void) nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, data_length);
#endif
}


bool is_tester_board(void)
{
    return (m_board_role == BOARD_TESTER);
}


void current_config_print(nrf_cli_t const * p_cli)
{
    char const * role = (m_board_role == BOARD_TESTER) ? "tester" :
                        (m_board_role == BOARD_DUMMY)  ? "dummy" : "not selected";

    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL, "==== Current test configuration ====\r\n");
    nrf_cli_fprintf(p_cli, NRF_CLI_NORMAL,
                    "Board role:\t\t%s\r\n"
                    "ATT MTU size:\t\t%d\r\n"
                    "Connection interval:\t%d units\r\n"
                    "Data length ext:\t%s\r\n"
                    "Connection length ext:\t%s\r\n"
                    "Preferred PHY:\t\t%s\r\n"
    				"Data stream :\t\t%s\r\n"
    				"Continuous test:\t%s\r\n",
                    role,
                    m_test_params.att_mtu,
                    m_test_params.conn_interval,
                    m_test_params.data_len_ext_enabled ? "on" : "off",
                    m_test_params.conn_evt_len_ext_enabled ? "on" : "off",
                    phy_str(m_test_params.phys)
                    /*m_test_params.continuous_test	? "on" : "off"*/);
}


void test_begin(void) //called by cli module! see example_cmds.c
{
    //NRF_LOG_INFO("Preparing the test.\n\r");
    NRF_LOG_FLUSH();

#ifdef ENABLE_PHY_UPDATE
     m_phy_updated = true;
#endif

	allow_new_connections = true;
}


static void test_run(void)
{
	//memset(m_ifs_tof.buffer, 0x00, TOF_SAMPLES_TO_ACQUIRE); //reset the buffer, create a function in ifs_tof module
	ifs_tof_enable_module();
}


static bool is_test_ready()
{
    return (
			m_conn_interval_configured

#ifdef ENABLE_PHY_UPDATE
            && m_phy_updated
#endif
            && !m_run_test);
}


void test_terminate(void)
{
    m_run_test                 = false;
#ifdef ENABLE_GATT
    m_mtu_exchanged            = false;
    m_data_length_updated      = false;
#endif
#ifdef ENABLE_PHY_UPDATE
    m_phy_updated              = false;
#endif
    m_conn_interval_configured = false;
    ifs_tof_disable_module();
	for (uint8_t i = 0; i < MAXIMUM_NUMBER_OF_CENTRAL_CONN; i++) { //reset all instance of m_ifs_tof and register the same handler for each node
		ifs_tof_init_struct(&m_ifs_tof[i]);
	}


	scan_stop();
	advertising_stop();
	for (uint8_t n = 0; n < MAXIMUM_NETWORK_SIZE; n++) {
		if (m_network[n].conn_handle != BLE_CONN_HANDLE_INVALID) {
			sd_ble_gap_disconnect(m_network[n].conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		}
	}
	reset_network();
}


void cli_init(void)
{
    if (CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk)
    {
        ret_code_t err_code = nrf_cli_init(&m_cli_rtt, NULL, true, true, NRF_LOG_SEVERITY_DEBUG);
        APP_ERROR_CHECK(err_code);
    }

    nrf_drv_uart_config_t uart_config = NRF_DRV_UART_DEFAULT_CONFIG;
    uart_config.pseltxd = TX_PIN_NUMBER;
    uart_config.pselrxd = RX_PIN_NUMBER;
    uart_config.hwfc    = NRF_UART_HWFC_ENABLED;
    uart_config.pselcts = CTS_PIN_NUMBER;
    uart_config.pselrts = RTS_PIN_NUMBER;

    ret_code_t err_code = nrf_cli_init(&m_cli_uart, &uart_config, true, true, NRF_LOG_SEVERITY_DEBUG);//NRF_LOG_SEVERITY_INFO);
    APP_ERROR_CHECK(err_code);
}


void cli_start(void)
{
    ret_code_t err_code =  nrf_cli_start(&m_cli_uart);
    APP_ERROR_CHECK(err_code);
}


void cli_process(void)
{
    nrf_cli_process(&m_cli_uart);
}

void tof_init(){
	ifs_tof_init(m_ifs_tof);
	for (uint8_t i = 0; i < MAXIMUM_NUMBER_OF_CENTRAL_CONN; i++) { //reset all instance of m_ifs_tof and register the same handler for each node
		ifs_tof_init_struct(&m_ifs_tof[i]);
	}
}

int main(void)
{
    log_init();

    cli_init();
    leds_init();
    timer_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    //advertising_data_set();
		advertising_init();
		advertising_start();

    (void) sd_ble_gap_tx_power_set(0);

    reset_network();
    client_init();
    gatt_mtu_set(m_test_params.att_mtu);
    data_len_ext_set(m_test_params.data_len_ext_enabled);
    conn_evt_len_ext_set(m_test_params.conn_evt_len_ext_enabled);
    preferred_phy_set(&m_test_params.phys);

    tof_init();

    cli_start();

    buttons_enable();
    ifs_offset_ticks = calculate_ifs_offset(m_test_params.phys);

	for (;;) {

		cli_process();

		if (is_test_ready()) 
		{
			m_run_test = true;
			test_run();
		}

		if (NRF_LOG_PROCESS() == false){
            wait_for_event();
        }
    }
}


